src/data_analysis/collected_data/orange/api/standarda4v2/d/load_read.txt
Running 30m test @ http://20.90.249.222:60/wrk2-api/home-timeline/read
  2 threads and 1000 connections
  Thread calibration: mean lat.: 2402.189ms, rate sampling interval: 10420ms
  Thread calibration: mean lat.: 2259.812ms, rate sampling interval: 10035ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.53m     7.58m   26.93m    58.91%
    Req/Sec    56.08     11.34    73.00     63.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.30m 
 75.000%   20.85m 
 90.000%   24.36m 
 99.000%   26.93m 
 99.900%   27.61m 
 99.990%   27.93m 
 99.999%   28.10m 
100.000%   28.24m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2213.887     0.000000            1         1.00
  188874.751     0.100000        20263         1.11
  389808.127     0.200000        40539         1.25
  612892.671     0.300000        60799         1.43
  783810.559     0.400000        81072         1.67
  918028.287     0.500000       101330         2.00
  986185.727     0.550000       111484         2.22
 1051721.727     0.600000       121621         2.50
 1116733.439     0.650000       131764         2.86
 1181745.151     0.700000       141829         3.33
 1250951.167     0.750000       152096         4.00
 1286602.751     0.775000       157044         4.44
 1323302.911     0.800000       162094         5.00
 1358954.495     0.825000       167214         5.71
 1394606.079     0.850000       172339         6.67
 1428160.511     0.875000       177326         8.00
 1444937.727     0.887500       179850         8.89
 1461714.943     0.900000       182369        10.00
 1478492.159     0.912500       184922        11.43
 1495269.375     0.925000       187519        13.33
 1512046.591     0.937500       190031        16.00
 1520435.199     0.943750       191333        17.78
 1528823.807     0.950000       192567        20.00
 1537212.415     0.956250       193820        22.86
 1546649.599     0.962500       195129        26.67
 1556086.783     0.968750       196346        32.00
 1561329.663     0.971875       196936        35.56
 1567621.119     0.975000       197566        40.00
 1574961.151     0.978125       198191        45.71
 1584398.335     0.981250       198854        53.33
 1594884.095     0.984375       199490        64.00
 1600126.975     0.985938       199776        71.11
 1606418.431     0.987500       200099        80.00
 1611661.311     0.989062       200398        91.43
 1617952.767     0.990625       200728       106.67
 1624244.223     0.992188       201073       128.00
 1626341.375     0.992969       201186       142.22
 1629487.103     0.993750       201347       160.00
 1632632.831     0.994531       201523       182.86
 1635778.559     0.995313       201675       213.33
 1638924.287     0.996094       201820       256.00
 1641021.439     0.996484       201917       284.44
 1643118.591     0.996875       202007       320.00
 1645215.743     0.997266       202069       365.71
 1647312.895     0.997656       202158       426.67
 1649410.047     0.998047       202224       512.00
 1650458.623     0.998242       202262       568.89
 1652555.775     0.998437       202325       640.00
 1653604.351     0.998633       202357       731.43
 1654652.927     0.998828       202376       853.33
 1656750.079     0.999023       202414      1024.00
 1657798.655     0.999121       202433      1137.78
 1658847.231     0.999219       202451      1280.00
 1660944.383     0.999316       202477      1462.86
 1661992.959     0.999414       202496      1706.67
 1664090.111     0.999512       202519      2048.00
 1665138.687     0.999561       202531      2275.56
 1665138.687     0.999609       202531      2560.00
 1666187.263     0.999658       202544      2925.71
 1667235.839     0.999707       202551      3413.33
 1669332.991     0.999756       202562      4096.00
 1670381.567     0.999780       202566      4551.11
 1671430.143     0.999805       202573      5120.00
 1672478.719     0.999829       202581      5851.43
 1672478.719     0.999854       202581      6826.67
 1674575.871     0.999878       202587      8192.00
 1674575.871     0.999890       202587      9102.22
 1675624.447     0.999902       202591     10240.00
 1676673.023     0.999915       202597     11702.86
 1676673.023     0.999927       202597     13653.33
 1676673.023     0.999939       202597     16384.00
 1677721.599     0.999945       202599     18204.44
 1678770.175     0.999951       202602     20480.00
 1678770.175     0.999957       202602     23405.71
 1678770.175     0.999963       202602     27306.67
 1679818.751     0.999969       202603     32768.00
 1685061.631     0.999973       202606     36408.89
 1685061.631     0.999976       202606     40960.00
 1685061.631     0.999979       202606     46811.43
 1685061.631     0.999982       202606     54613.33
 1685061.631     0.999985       202606     65536.00
 1686110.207     0.999986       202608     72817.78
 1686110.207     0.999988       202608     81920.00
 1686110.207     0.999989       202608     93622.86
 1686110.207     0.999991       202608    109226.67
 1686110.207     0.999992       202608    131072.00
 1686110.207     0.999993       202608    145635.56
 1686110.207     0.999994       202608    163840.00
 1686110.207     0.999995       202608    187245.71
 1694498.815     0.999995       202609    218453.33
 1694498.815     1.000000       202609          inf
#[Mean    =   871623.694, StdDeviation   =   454843.104]
#[Max     =  1693450.240, Total count    =       202609]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  205779 requests in 30.00m, 2.71GB read
  Socket errors: connect 0, read 46585, write 247925, timeout 124117
  Non-2xx or 3xx responses: 1179
Requests/sec:    114.32
Transfer/sec:      1.54MB